CREATE DATABASE DinnerDB;
go

USE DinnerDB;
go


CREATE TABLE LeftItem(
id int primary key,
name varchar(50),

);
go

create table ItemToDetails(
id int primary key,
name varchar(50),
price float,
leave int default 0,
sold int default 0,
picture varchar(100) null, 
ItemID int
);
go

insert into LeftItem values
(1, '²âÊÔ²Ëµ¥Ò»'),
(2, '²âÊÔ²Ëµ¥¶þ'),
(3, '²âÊÔ²Ëµ¥Èý'),
(4, '²âÊÔ²Ëµ¥ËÄ'),
(5, '²âÊÔ²Ëµ¥Îå'),
(6, '²âÊÔ²Ëµ¥Áù'),
(7, '²âÊÔ²Ëµ¥Æß'),
(8, '²âÊÔ²Ëµ¥°Ë')
go

insert into ItemToDetails values
(1,'²Ë1-1', 10.05, 50, 30, '/image/0001.png', 1),
(2,'²Ë1-2', 9.99, 50, 30, '/image/0002.png', 1),
(3,'²Ë1-3', 12.99, 40, 30, '/image/0003.png', 1),
(4,'²Ë1-4', 43.00, 50, 130, '/image/0004.png', 1),
(5,'²Ë1-5', 5.30, 50, 60, '/image/0005.png', 1),
(6,'²Ë2-1', 10.05, 20, 30, '/image/0001.png', 2),
(7,'²Ë2-2', 9.99, 50, 30, '/image/0002.png', 2),
(8,'²Ë2-3', 12.99, 50, 30, '/image/0003.png', 2),
(9,'²Ë2-4', 43.00, 50, 80, '/image/0004.png', 2),
(10,'²Ë2-5', 5.30, 50, 60, '/image/0005.png', 2),
(11,'²Ë2-6', 10.05, 50, 30, '/image/0001.png', 2),
(12,'²Ë2-7', 9.99, 50, 10, '/image/0002.png', 2),
(13,'²Ë2-8', 12.99, 60, 20, '/image/0003.png', 2),
(14,'²Ë2-9', 43.00, 50, 30, '/image/0004.png', 2),
(15,'²Ë2-10', 5.30, 80, 30, '/image/0005.png', 2),
(16,'²Ë3-1', 10.05, 50, 30, '/image/0001.png', 3),
(17,'²Ë3-2', 9.99, 50, 30, '/image/0002.png', 3),
(18,'²Ë3-3', 12.99, 40, 30, '/image/0003.png', 3),
(19,'²Ë3-4', 43.00, 50, 130, '/image/0004.png', 3),
(20,'²Ë3-5', 5.30, 50, 60, '/image/0005.png', 3),
(21,'²Ë3-6', 10.05, 20, 30, '/image/0001.png', 3),
(22,'²Ë3-7', 9.99, 50, 30, '/image/0002.png', 3),
(23,'²Ë3-8', 12.99, 50, 30, '/image/0003.png', 3),
(24,'²Ë3-9', 43.00, 50, 80, '/image/0004.png', 3),
(25,'²Ë3-10', 5.30, 50, 60, '/image/0005.png', 3),
(26,'²Ë3-11', 10.05, 50, 30, '/image/0001.png', 3),
(27,'²Ë3-12', 9.99, 50, 10, '/image/0002.png', 3),
(28,'²Ë3-13', 12.99, 60, 20, '/image/0003.png', 3),
(29,'²Ë3-14', 43.00, 50, 30, '/image/0004.png', 3),
(30,'²Ë3-15', 5.30, 80, 30, '/image/0005.png', 3)
go

insert into ItemToDetails values
(31,'²Ë4-1', 43.00, 50, 80, '/image/0004.png', 4),
(32,'²Ë5-1', 12.99, 60, 20, '/image/0003.png', 5),
(33,'²Ë6-1', 10.05, 50, 30, '/image/0001.png', 6),
(34,'²Ë7-1', 43.00, 50, 80, '/image/0004.png', 7),
(35,'²Ë8-1', 9.99, 50, 30, '/image/0002.png', 8)
go